import Foundation

class ConvertData {
    
    static let converDataHealper = ConvertData()
    
    var isChinese = true
    
    var titleLists: [String] {
        if isChinese {
            return ["长度换算表","电流换算表","密度换算表","面积换算表","速度换算表","时间换算表",]
            //"体积","温度","重量"
        }else {
            return ["Length Conversion","Electric Current Conversion","Density Conversion","Area Conversion","Speed Conversion","Time Conversion"]
        }
    }
    var nameLists: [String] {
        if isChinese {
            return ["长度","电流","密度","面积","速度","时间",]
            //"体积","温度","重量"
        }else {
            return ["Length","Electric Current","Density","Area","Speed","Time"]
        }
    }
    var unitsNameLists: [[String]] {
        if isChinese {
            return [["米","微米","毫米","厘米","分米","公里","纳米"],
                    ["绝对安培","安培","毕奥","厘安","库仑/秒","分安"],
                    ["千克/立方米","克/立方米","毫克/立方米","千克/升","克/升","厘克/升"],
                    ["平方米","平方毫米","平方厘米","平方分米","公顷"],
                    ["米/秒","米/分","米/时","千米/秒","千米/分","千米/时"],
                    ["毫秒","秒","分","时","天","周"]]
        }else {
            return [ ["meter","mucrometer","millimeter","centimeter","decimeter","kilometer","nanometers"],
                ["abampere","ampere","biot","centiampere","coulomb/second","deciampere"],
                ["kilogram/cubic meter","gram/cubic meter","milligram/cubic meter","kilogram/liter","gram/liter","centigram/liter"],
                ["square meter","square millimeter","square centimeter", "square decimeter","hectare"],
                ["meter/second","meter/minute","meter/hour","kilometer/second","kilometer/minute","kilometer/hour"],
                ["millisecond","second","minute","hour","day","week"]]
        }
    }
    let unitsLists: [[String]] = [
        ["m","μm","mm","cm","dm","km","nm"],
        ["abA","A","biot","cA","C/s","dA"],
        ["kg/m^3","g/m^3","mg/m^3","kg/L","g/L","cg/L"],
        ["m^2","mm^2","cm^2","dm^2","ha"],
        ["m/s","m/min","m/h","km/s","km/min","km/h"],
        ["ms","s","m","h","d","w"]
    ]
    let measurements: [[String:[Double]]] = [
        [
            "m": [1.0, 1_000_000, 1_000, 100, 10, 0.001, 1_000_000_000],
            "μm": [0.000001, 1, 0.001, 0.0001, 0.00001, 0.000_000_001, 1_000],
            "mm": [0.001, 1000, 1, 0.1, 0.01, 0.000_001, 1_000_000],
            "cm": [0.01, 10_000, 10, 1, 0.1, 0.000_01, 10_000_000],
            "dm": [0.1, 100_000, 100, 10, 1, 0.0001, 100_000_000],
            "km": [1_000, 1_000_000_000, 1_000_000, 100_000, 10_000, 1, 1_000_000_000_000],
            "nm": [0.000_000_001, 0.001, 0.000_001, 0.000_000_1, 0.000_000_01, 0.000_000_000_001, 1]
        ],
        [
            "abA": [1, 10, 1, 1000, 10, 100],
            "A": [0.1, 1, 0.1, 100, 1, 10],
            "biot": [1, 10, 1, 1000, 10, 100],
            "cA": [0.001, 0.01, 0.001, 1, 0.01, 0.1],
            "C/s": [0.1, 1, 0.1, 100, 1, 10],
            "dA": [0.01, 0.1, 0.01, 10, 0.1, 1]
        ],
        [
            "kg/m^3": [1, 1000, 1_000_000, 0.001, 1, 100],
            "g/m^3": [0.001, 1, 1_000, 0.000_001, 0.001, 0.1],
            "mg/m^3": [0.000001, 0.001, 1, 0.000000001, 0.000001, 0.0001],
            "kg/L": [1000, 1000000, 1000000000, 1, 1000, 1000_000],
            "g/L": [1, 1000, 1_000_000, 0.001, 1, 100],
            "cg/L": [0.01, 10, 10000, 0.00001, 0.01, 1]
        ],
        [
            "m^2": [1, 1000000, 10000, 100, 0.0001],
            "mm^2": [0.000001, 1, 0.01, 0.0001, 0.0000000001],
            "cm^2": [0.0001, 100, 1, 0.01, 0.00000001],
            "dm^2": [0.01, 10000, 100, 1, 0.000001],
            "ha": [10000, 10000000000, 100_000_000, 100_000, 1]
        ],[
            "m/s": [1, 60, 3600, 0.001, 0.06, 3.6],
            "m/min": [0.016667, 1, 60, 0.000017, 0.001, 0.06],
            "m/h": [0.0002778, 0.016667, 1, 2.777778e-7, 0.000017, 0.001],
            "km/s": [1000, 60000, 3600000, 1, 60, 3600],
            "km/min": [16.666667, 1000, 60000, 0.016667, 1, 60],
            "km/h": [0.277778, 16.666667, 1000, 0.000278, 0.16667, 1]
        ],[
            "ms": [1, 0.001, 0.000017, 2.777778e-7, 1.157407e-8, 1.653439e-9],
            "s": [1000, 1, 0.016667, 0.000278, 0.000012, 0.000002],
            "m": [60000, 60, 1, 0.016667, 0.000694, 0.000099],
            "h": [3600000, 3600, 60, 1, 0.041667, 0.005952],
            "d": [86400000, 86400, 1440, 24, 1, 0.142857],
            "w": [604800000, 604800, 10080, 168, 7, 1]
        ]]
}

